ellensp/framework-arduino-lpc5528/system/CMSIS/driver/fsl_spi_dma.c
static void SPI_SetupDummy16(SPI_Type *base, spi_dma_txdummy_t *dummy, spi_transfer_16t *xfer, spi_config_t *spi_config_p)
{
    uint32_t instance  = SPI_GetInstance(base);
    uint32_t dummydata = (uint32_t)s_dummyData[instance];
    dummydata |= (uint32_t)s_dummyData[instance] << 8U;

    dummy->word     = dummydata;
    dummy->lastWord = dummydata;

    XferToFifoWR16(xfer, &dummy->word);
    XferToFifoWR16(xfer, &dummy->lastWord);
    SpiConfigToFifoWR(spi_config_p, &dummy->word);
    SpiConfigToFifoWR(spi_config_p, &dummy->lastWord);
    /* Clear the end of transfer bit for continue word transfer. */
    dummy->word &= (~(uint32_t)kSPI_FrameAssert);
}

/*!
 * brief Initialize the SPI master DMA handle.
 *
 * This function initializes the SPI master DMA handle which can be used for other SPI master transactional APIs.
 * Usually, for a specified SPI instance, user need only call this API once to get the initialized handle.
 *
 * param base SPI peripheral base address.
 * param handle SPI handle pointer.
 * param callback User callback function called at the end of a transfer.
 * param userData User data for callback.
 * param txHandle DMA handle pointer for SPI Tx, the handle shall be static allocated by users.
 * param rxHandle DMA handle pointer for SPI Rx, the handle shall be static allocated by users.
 */
status_t SPI_MasterTransferCreateHandleDMA(SPI_Type *base,
                                           spi_dma_handle_t *handle,
                                           spi_dma_callback_t callback,
                                           void *userData,
                                           dma_handle_t *txHandle,
                                           dma_handle_t *rxHandle)
{
    uint32_t instance;

    /* check 'base' */
    assert(!(NULL == base));
    if (NULL == base)
    {
        return kStatus_InvalidArgument;
    }
    /* check 'handle' */
    assert(!(NULL == handle));
    if (NULL == handle)
    {
        return kStatus_InvalidArgument;
    }

    instance = SPI_GetInstance(base);

    (void)memset(handle, 0, sizeof(*handle));
    /* Set spi base to handle */
    handle->txHandle = txHandle;
    handle->rxHandle = rxHandle;
    handle->callback = callback;
    handle->userData = userData;

    /* Set SPI state to idle */
    handle->state = (uint8_t)kSPI_Idle;

    /* Set handle to global state */
    s_dmaPrivateHandle[instance].base   = base;
    s_dmaPrivateHandle[instance].handle = handle;

    /* Install callback for Tx dma channel */
    DMA_SetCallback(handle->txHandle, SPI_TxDMACallback, &s_dmaPrivateHandle[instance]);
    DMA_SetCallback(handle->rxHandle, SPI_RxDMACallback, &s_dmaPrivateHandle[instance]);

    return kStatus_Success;
}


status_t SPI_MasterTransferDMA16MemInc(SPI_Type *base, spi_dma_handle_t *handle, spi_transfer_16t *xfer)
{
 assert(!((NULL == handle) || (NULL == xfer)));

    uint32_t instance;
    status_t result = kStatus_Success;
    spi_config_t *spi_config_p;
    uint32_t address;

    if ((NULL == handle) || (NULL == xfer))
    {
        return kStatus_InvalidArgument;
    }

    /* Byte size is zero. */
    if (xfer->dataSize == 0U)
    {
        return kStatus_InvalidArgument;
    }
    /* cannot get instance from base address */
    instance = SPI_GetInstance(base);

    /* Check if the device is busy */
    if (handle->state == (uint8_t)kSPI_Busy)
    {
        return kStatus_SPI_Busy;
    }
    else
    {
        /* Clear FIFOs before transfer. */
        base->FIFOCFG |= SPI_FIFOCFG_EMPTYTX_MASK | SPI_FIFOCFG_EMPTYRX_MASK;
        base->FIFOSTAT |= SPI_FIFOSTAT_TXERR_MASK | SPI_FIFOSTAT_RXERR_MASK;

        dma_transfer_config_t xferConfig = {0};
        spi_config_p                     = (spi_config_t *)SPI_GetConfig(base);

        handle->state        = (uint8_t)kSPI_Busy;
        handle->transferSize = xfer->dataSize;

        // /* receive */
        SPI_EnableRxDMA(base, true);
        address = (uint32_t)&base->FIFORD;
        DMA_PrepareTransfer(&xferConfig, (uint32_t *)address, &s_rxDummy,(sizeof(uint16_t)),
                            xfer->dataSize, kDMA_StaticToStatic, NULL);
        (void)DMA_SubmitTransfer(handle->rxHandle, &xferConfig);
        handle->rxInProgress = true;
        DMA_StartTransfer(handle->rxHandle);

        /* transmit */
        SPI_EnableTxDMA(base, true);
        address = (uint32_t)&base->FIFOWR;
    
        if ((xfer->configFlags & (uint32_t)kSPI_FrameAssert) != 0U)
        {
            PrepareTxLastWord17(xfer, &s_txLastWord[instance], spi_config_p);
        }
                dma_xfercfg_t tmp_xfercfg;
                tmp_xfercfg.valid         = true;
                tmp_xfercfg.swtrig        = true;
                tmp_xfercfg.intA          = true;
                tmp_xfercfg.byteWidth     = sizeof(uint32_t);
                tmp_xfercfg.srcInc        = 0;
                tmp_xfercfg.dstInc        = 0;
                tmp_xfercfg.transferCount = 1;
                tmp_xfercfg.reload        = false;
                tmp_xfercfg.clrtrig       = false;
                tmp_xfercfg.intB          = false;
                /* Create chained descriptor to transmit last word */
                DMA_CreateDescriptor(&s_spi_descriptor_table[instance], &tmp_xfercfg, &s_txLastWord[instance],
                                     (uint32_t *)address, NULL);
              
                DMA_PrepareTransfer(
                &xferConfig, xfer->txData, (uint32_t *)address, sizeof(uint16_t),
                ((spi_config_p->dataWidth > kSPI_Data8Bits) ? (xfer->dataSize - 2U) : (xfer->dataSize - 1U)),
                kDMA_MemoryToPeripheral, &s_spi_descriptor_table[instance]);
          
                /* Disable interrupts for first descriptor to avoid calling callback twice. */
                xferConfig.xfercfg.intA = false;
                xferConfig.xfercfg.intB = false;
                result                  = DMA_SubmitTransfer(handle->txHandle, &xferConfig);
                if (result != kStatus_Success)
                {
                    return result;
                }
        handle->txInProgress = true;
        uint32_t tmpData     = 0U;
        XferToFifoWR(xfer, &tmpData);
        SpiConfigToFifoWR(spi_config_p, &tmpData);

